# TextBoxEnterPressedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextBoxEnterPressedEventArgs Class
Members See Also
---
The event arguments used by TextBox's EnterPressed event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TextBoxEnterPressedEventArgs : RibbonItemEventArgs
```

Visual Basic
---
```text
Public Class TextBoxEnterPressedEventArgs _
	Inherits RibbonItemEventArgs
```

Visual C++
---
```text
public ref class TextBoxEnterPressedEventArgs : public RibbonItemEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.UI.Events..::..RibbonItemEventArgs Autodesk.Revit.UI.Events..::..TextBoxEnterPressedEventArgs
# See Also
TextBoxEnterPressedEventArgs Members
Autodesk.Revit.UI.Events Namespace